IDEA Open Model
SubStructureGeometry Class
Compatible with IDEA StatiCa 20.1
 SubStructureGeometry
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.SubStructureGeometry
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class SubStructureGeometry : OpenObject
Public Class SubStructureGeometry
	Inherits OpenObject
The SubStructureGeometry type exposes the following members.
Constructors
Name | Description
SubStructureGeometry
 Constructor
Top
Properties
Name | Description
ConnectionPoints
 Array of connection points
RealMembers
 Array of DesignMemberInSubStructure
TheoreticalMembers
 Array of DesignMemberInSubStructure
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace